Revit 2027 API
ParameterTypeId.ImportAdtComponentsDesc Property
 "Component Description"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ImportAdtComponentsDesc { get; }
Public Shared ReadOnly Property ImportAdtComponentsDesc As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ImportAdtComponentsDesc {
	ForgeTypeId^ get ();
}
static member ImportAdtComponentsDesc : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace